{
  "title": "Smart Product Passport",
  "connect_wallet": "Connect Wallet",
  "scan": "Scan Product",
  "passports": "Passports",
  "about": "About",
  "main": "Home",
  "createNFT": "New Passport",
  "createNFTProductPassport": "Create NFT Product Passport",
  "language": "Language",
  "english": "English",
  "ukrainian": "Ukrainian",
  "secure_storage": "Secure Storage",
  "secure_storage_desc": "All data is stored in the decentralized Solana network, ensuring maximum security and reliability.",
  "qr_codes": "QR Codes",
  "qr_codes_desc": "Quick access to information via QR codes for instant product authenticity checks.",
  "authenticity_check": "Authenticity Check",
  "authenticity_check_desc": "Instant product authenticity verification with detailed history and characteristics.",
  "how_it_works": "How it works?",
  "step1": "Connect your Solana wallet to access the system.",
  "step2": "Add product information and upload documents.",
  "step3": "Get a unique QR code for your product.",
  "step4": "Scan QR codes to verify product authenticity.",
  "footer_text": "© 2025 Smart Product Passport. All rights reserved.",
  "create_passport": "Create Passport",
  "manufacturer_id": "Manufacturer ID",
  "additional_docs": "Additional Documents",
  "view": "View",
  "none": "None",
  "serial_number": "Serial Number",
  "production_date": "Production Date",
  "model": "Model",
  "warranty_period": "Warranty Period",
  "country_of_origin": "Country of Origin",
  "actions": "Actions",
  "about_us": "About Us",
  "about_us_text1": "Smart Product Passport is an innovative solution for creating and managing digital product passports. Our platform uses the Solana blockchain for data security and transparency.",
  "about_us_text2": "We provide tools for manufacturers, dealers, and end users to create, verify, and manage digital product passports.",
  "about_us_text3": "Our mission is to make product tracking and verification more efficient and secure.",
  "about_mission_title": "Our Mission",
  "about_offerings_title": "What We Offer",
  "about_offerings_desc": "We provide comprehensive tools for all market participants:",
  "about_manufacturers": "Manufacturers:",
  "about_manufacturers_desc": "creation and management of digital product passports",
  "about_dealers": "Dealers:",
  "about_dealers_desc": "authenticity verification and product tracking",
  "about_consumers": "Consumers:",
  "about_consumers_desc": "instant verification of product authenticity through QR codes",
  "about_benefits_title": "Key Benefits",
  "about_convenience": "Convenience",
  "about_convenience_desc": "Quick access through QR codes and mobile devices",
  "about_transparency": "Transparency",
  "about_transparency_desc": "Complete product history available to every user",
  "about_speed": "Speed",
  "about_speed_desc": "Instant verification of product authenticity",
  "about_goal_title": "Our Goal",
  "about_future_title": "Future Technologies",
  "about_future_desc": "Using the latest blockchain technologies, we create an ecosystem where every product has its unique digital passport, guaranteeing its authenticity and providing complete information about its history.",
  "about_join_title": "Join Us",
  "about_join_desc": "Become part of the revolution in digital product passports. Together we create a safer and more transparent future for all market participants.",
  "about_trust": "Trust",
  "about_security": "Security",
  "about_innovation": "Innovation",
  "faq_title": "Frequently Asked Questions",
  "faq_manufacturer_q": "How can manufacturers use Smart Product Passport?",
  "faq_manufacturer_a": "Manufacturers can create digital passports for their products, including detailed information about manufacturing date, warranty, and authenticity. This helps in product tracking, warranty management, and combating counterfeiting.",
  "faq_consumer_q": "How does Smart Product Passport benefit consumers?",
  "faq_consumer_a": "Consumers can verify product authenticity, access warranty information, and view product history by simply scanning a QR code. This ensures they're purchasing genuine products and helps with warranty claims.",
  "faq_retailer_q": "What advantages does Smart Product Passport offer to retailers?",
  "faq_retailer_a": "Retailers can verify product authenticity, manage inventory more effectively, and provide better customer service by having instant access to product information. It also helps in building trust with customers.",
  "faq_warranty_q": "How does the warranty system work?",
  "faq_warranty_a": "Each product passport contains warranty information that is stored on the blockchain. This ensures warranty data cannot be tampered with and provides a transparent record of warranty terms and conditions.",
  "faq_authenticity_q": "How can I verify product authenticity?",
  "faq_authenticity_a": "Simply scan the QR code on the product using our app. The system will instantly verify the product's authenticity by checking its digital passport on the blockchain, providing you with detailed product information and history.",
  "comics_title": "Our Comics",
  "comics_subtitle": "Learn more about Smart Product Passport through our exciting comics",
  "comics_read_more": "Read more",
  "comics_view_all": "View all comics",
  "comic_1_title": "Smart Product Passport Protocol",
  "comic_1_desc": "Revolutionary protocol for creating digital product passports",
  "comic_1_fullStory": "This comic shows the revolutionary Smart Product Passport protocol, which creates digital passports for every product. Our technology allows the entire product history to be stored on the Solana blockchain, ensuring transparency and trust among all market participants. Each product receives a unique digital identifier containing information about the manufacturer, production date, warranty, and all subsequent transactions.",
  "comic_1_technology": "Solana blockchain provides speed, security, and low transaction costs. IPFS stores documents and images. QR codes provide instant access to information.",
  "comic_2_title": "Colloseum Breakout Hackathon",
  "comic_2_desc": "Our project at the largest Solana hackathon",
  "comic_2_fullStory": "At the Colloseum Breakout hackathon, we presented our solution to the global developer community. This comic shows how our team created an innovative solution for digital product passports. The hackathon allowed us to test the technology in real conditions and receive valuable feedback from blockchain industry experts.",
  "comic_2_technology": "Colloseum Breakout is the largest hackathon in the Solana ecosystem. Our team used the Anchor framework for smart contract development and React for an intuitive interface.",
  "comic_3_title": "Future of NFTs and Smart Passports",
  "comic_3_desc": "How NFT technologies are changing the world of products",
  "comic_3_fullStory": "The future belongs to NFT technologies and smart passports. This comic illustrates how every product becomes a unique digital asset with a complete history. NFT passports allow tracking the entire product lifecycle—from manufacturing to disposal—ensuring transparency and trust.",
  "comic_3_technology": "NFTs (Non-Fungible Tokens) ensure the uniqueness of each passport. Smart contracts automate verification and ownership transfer processes. This is a revolution in logistics and anti-counterfeiting.",
  "comic_4_title": "Updates through Smart Product Passport",
  "comic_4_desc": "Easy product updates using smart passports",
  "comic_4_fullStory": "Smart Product Passport makes product updates simple and secure. The user can easily update firmware, drivers, or settings via QR code. The entire update history is stored on the blockchain, ensuring transparency and security of the process.",
  "comic_4_technology": "QR codes provide instant access to information. Blockchain stores the history of all updates. Automated processes reduce the risk of errors and ensure data consistency.",
  "comic_5_title": "Skydiving over Futuristic City",
  "comic_5_desc": "Daring flight into the future of technology",
  "comic_5_fullStory": "As a skydiver rises above the city, so does our technology elevate the industry to a new level. This comic symbolizes a bold flight into the future, where every product has its digital passport. This is the future of transparency, trust, and innovation.",
  "comic_5_technology": "Blockchain technologies create a new paradigm of trust. Decentralized systems ensure independence from central authorities. This is the foundation for the Web3 economy.",
  "comic_6_title": "Easy Driver Updates",
  "comic_6_desc": "Simplified software update process",
  "comic_6_fullStory": "Driver updates are no longer a complex task. Smart Product Passport automatically identifies the product and finds the appropriate updates. The user receives personalized recommendations and can easily install the necessary updates via QR code.",
  "comic_6_technology": "AI algorithms analyze product characteristics and find suitable updates. Blockchain ensures the authenticity of updates. Automated processes reduce technical complexity for users.",
  "full_story": "Full Story",
  "technology_details": "Technology Details",
  "close": "Close",
  "3d_demo_title": "3D NFT Demo: Scan & Claim!",
  "3d_demo_desc": "Try our capabilities: rotate the 3D box, scan the QR code, and get a test NFT. This is a demonstration for manufacturers, drivers, consumers. NFT is free!",
  "3d_demo_nft_title": "Test NFT:",
  "3d_demo_nft_desc": "Manufacturer: SPP Demo | Category: drivers | For testing — scan the QR code and get the NFT to your Solana wallet.",
  "collection": "Collection",
  "collection_placeholder": "Select collection",
  "collection_category": "Category",
  "collection_name": "Collection name",
  "collection_electronics": "Electronics",
  "collection_clothing": "Clothing",
  "collection_furniture": "Furniture",
  "collection_automotive": "Automotive",
  "collection_healthcare": "Healthcare",
  "collection_food": "Food & Beverage",
  "collection_other": "Other"
} 